[
    {
        "title" : "What is Computer?",
        "subtitle" : "Computer คือ อุปกรณ์อิเล็กทรอนิกส์ สำหรับคำนวณ และประมวลผลข้อมูลเพื่อประโยชน์ทางด้านธุรกิจ",
        "image_url" : "https://cdn.pixabay.com/photo/2022/10/20/02/23/musk-ox-7533939_960_720.jpg",
        "detail" : "คอมพิวเตอร์ (อังกฤษ: computer) หรือศัพท์บัญญัติราชบัณฑิตยสภาว่า คณิตกรณ์[2][3] เป็นเครื่องจักรแบบสั่งการได้ที่ออกแบบมาเพื่อดำเนินการกับลำดับตัวดำเนินการทางตรรกศาสตร์หรือคณิตศาสตร์ โดยอนุกรมนี้อาจเปลี่ยนแปลงได้เมื่อพร้อม ส่งผลให้คอมพิวเตอร์สามารถแก้ปัญหาได้มากมาย\n\nคอมพิวเตอร์ถูกประดิษฐ์ออกมาให้ประกอบไปด้วยความจำรูปแบบต่าง ๆ เพื่อเก็บข้อมูล อย่างน้อยหนึ่งส่วนที่มีหน้าที่ดำเนินการคำนวณเกี่ยวกับตัวดำเนินการทางตรรกศาสตร์ และตัวดำเนินการทางคณิตศาสตร์ และส่วนควบคุมที่ใช้เปลี่ยนแปลงลำดับของตัวดำเนินการโดยยึดสารสนเทศที่ถูกเก็บไว้เป็นหลัก อุปกรณ์เหล่านี้จะยอมให้นำเข้าข้อมูลจากแหล่งภายนอก และส่งผลจากการคำนวณตัวดำเนินการออกไป"
    },
    {
        "title" : "What is Programming?",
        "subtitle" : "การเขียนหรือสร้างคำสั่งให้คอมพิวเตอร์ทำงานให้ได้ตามที่ต้องการ ด้วยภาษาที่คอมพิวเตอร์เข้าใจ",
        "image_url" : "https://cdn.pixabay.com/photo/2015/12/04/14/05/code-1076536_960_720.jpg",
        "detail" : "โปรแกรมคอมพิวเตอร์ (อังกฤษ: computer program) เป็นชุดคำสั่ง[1] ที่ปฏิบัติงานเฉพาะเมื่อคอมพิวเตอร์สั่งกระทำการ (execute) คอมพิวเตอร์เครื่องหนึ่งต้องการใช้โปรแกรมในการสั่งงาน และกระทำตามชุดคำสั่งในหน่วยประมวลผลกลาง[2]\n\nโปรแกรมคอมพิวเตอร์มักเขียนโดยนักเขียนโปรแกรมโดยใช้ภาษาโปรแกรม คอมไพเลอร์สามารถแปลงรหัสเครื่อง (machine code) ที่ประกอบด้วยชุดคำสั่งที่คอมพิวเตอร์สามารถกระทำการได้โดยตรงได้จากรหัสต้นฉบับ (source code) แบบมนุษย์อ่านได้ หรืออีกทางหนึ่ง โปรแกรมคอมพิวเตอร์สามารถกระทำการได้ด้วยอินเทอร์พรีเตอร์"
    },
    {
        "title" : "What is Programmer?",
        "subtitle" : "นักเขียนโปรแกรมคอมพิวเตอร์ ที่สามารถที่จะพัฒนา สร้างและแก้ไขปัญหาและยังรวมไปถึงการวิเคราะห์ข้อมูลเพื่อปรับปรุงให้ดีขึ้นเพื่อที่จะได้โปรแกรมหรือว่า Application ที่จะใช้งานบนอุปกรณ์เทคโนโลยีในปัจจุบัน",
        "image_url" : "https://cdn.pixabay.com/photo/2012/11/07/07/31/man-65049_960_720.jpg",
        "detail" : "นักเขียนโปรแกรม หรือ โปรแกรมเมอร์ (อังกฤษ: programmer) มีหน้าที่หลักคือการเขียนโปรแกรมคอมพิวเตอร์ ซึ่งนักเขียนโปรแกรมสามารถหมายถึงผู้ที่เชี่ยวชาญในการโปรแกรมเฉพาะด้าน หรือผู้ที่สามารถเขียนรหัสซอฟต์แวร์ได้หลากหลายข้อมูล"
    }
]